{
  "basic_info": {
    "description_header": "Hi",
    "description": "👋 I'm Derek Roode. I am a Full Stack Software Developer. I am well versed in languages such as React, Redux, Flask and Express. I’m a passionate software developer with the innovative and creative mindset of an entrepreneur. Thinking outside the box is what I am best at. I have experience building dynamic web applications in JavaScript, React, Redux, and HTML/CSS with a focus on UI and design. I love the battle of developing an idea into existence, and forging the bridge between conceptualization and a tangible, impactful product. I have a reputation for asking great questions, shipping quality code, being a strong pair and working well across teams. ",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "BoxIt",
      "startDate": "2021",
      "description": "Your AI Boxing Coach! Get the workout you deserve! Developer, React, Javascript, Flask · A smart interactive boxing coach that will be loaded with workouts and served based on the amount of favorites they receive. Challenge your friends and co-workers to the top of the leaderboard or create a new group and challenge each other from within. Full development frontend and backend",
      "images": [
        "images/portfolio/boxit/img1.gif",
        "images/portfolio/boxit/img2.gif"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        }
      ]
    },
    {
      "title": "Fetch",
      "startDate": "2020",
      "description": "One of The most expanded application I had opportunity to build. Developer, React Js, Javascript, Redux · We have a dream and that dream is to have a site that you can go to at any time day or night and look at thousands of pictures of dogs!!! Who doesn't love that idea! With our top of the line image recognition software we can verify that every picture does indeed contain an image of a dog.",
      "images": [
        "images/portfolio/fetch/p1.jpg",
        "images/portfolio/fetch/p2.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    },
    {
      "title": "Good Games",
      "startDate": "2020",
      "description": "One of the first apps I was worked on with a remote group. I helped to develop the front-end and back-end for the application. GoodGames is an game cataloging website that allows individuals to rate, comment on, and browse video games of all types. Users can sign up and register to add games to their Game Center to let others know what games they want to play, what they are currently playing, and what they have already played.",
      "images": [
        "images/portfolio/good-games/p1.gif",
        "images/portfolio/good-games/p2.gif",
        "images/portfolio/good-games/p3.gif"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "DefOpenSource",
      "title": "Front-End Developer",
      "years": "10.2019 - present",
      "mainTech": ["Angular 8/9/10"],
      "technologies": [
        "REST API",
        "RxJS",
        "JavaScript",
        "Bootstrap",
        "MDBootstrap",
        "EF Core",
        ".NET Core",
        "SignalR",
        "Angular Material"
      ]
    },
    {
      "company": "Serros Solutions",
      "title": "Intern",
      "years": "01.2018 - 09.2019",
      "mainTech": ["Angular 7/8"],
      "technologies": ["RxJS", "Django", "PHP", "JavaScript", "DHTMLX Gantt"]
    }
  ]
}
